#include <intrins.h>

//*==============================================|=====================*
//*函数原型:
//*功能描述:    微妙级延时函数
//*说    明:	晶振11.0592Mhz 12T 函数体中单独放_nop_()表示1us
//*测    试:	已测试,方规 逻辑分析仪测试长度如下:
//	DelayUs(3);				//延时2.5us
//	DelayUs(5);				//延时3.5us
//	DelayUs(10);			//延时4.5us
//	DelayUs(30);			//延时53us
//	DelayUs(100);			//延时167us
//	DelayUs(10);
//	DelayUs(10);
//	DelayUs(10);
//	DelayUs(10);
//	DelayUs(10);			//延时21us
//	DelayUs(500);			//延时819us
//	DelayMs(500);			//延时491
//*结    论:	此函数做不到精确延时,以上数据供以后参考,对时序要求严格的驱动,
//*				一定要使用仪器来测量,此延时跟晶振和指令周期都有关系
//*==============================================|=====================*
void DelayUs(unsigned int us)		//1000 -> 1.7ms
{
	unsigned int j;		
	if(us==3){
		_nop_();_nop_();_nop_();
		return;
	}	
	if(us==5){
		_nop_();_nop_();_nop_();_nop_();_nop_();
		return;
	}
	if(us==10){
		_nop_();_nop_();_nop_();_nop_();_nop_();
		_nop_();_nop_();_nop_();_nop_();_nop_();
		return;
	}
	for(j=0;j<us;j++){
		_nop_();
	}
}

//*==============================================|=====================*
//*函数原型:    
//*功能描述:    毫秒级延时函数
//*说    明:	晶振11.0592Mhz 12T 1000表示1秒延时
//*测    试:	已测试,方规
//*==============================================|=====================*
void DelayMs(unsigned int ms)		//1000 -> 1秒
{
	unsigned int i=0;
	for(i=0;i<ms;i++){
		DelayUs(600);
	}
}